// // ************************************ 3 task буде в index3.html ******************************************
// // *********************************   та в index3-sessions.html   *****************************************
//
// // Є сторінка index.html (назва довільна), при відвідуванні якої в локальне сховще, в масив sessions зберігається інформація про дату та час відвідування сторінки. Є ще сторінка sessions.html (назва довільна), при відвідуванні якої потрібно відмалювати всю інформацію про відвідування сторінки index.html. Інфу НЕ виводити в консоль, а побудувати дом структуру під кожну сессію



const json = localStorage.getItem('sessions'); // Отримуємо дані про сесії з локального сховища
const sessions = json ? JSON.parse(json) : [];    // Якщо є json - парсимо, в іншому випадку - ств. []

                            // Додаємо новий об'єкт сесії до масиву
sessions.push({

    date: new Date().toISOString(),    // Зберігаємо поточну дату та час в форматі ISOString

    userLanguage: navigator.language,    // Зберігаємо мову браузера користувача

    userAgentInfo: navigator.userAgent    // Зберігаємо інформацію про користувача у локальному сховищі
});

// Зберігаємо оновлений масив сесій у локальному сховищі
localStorage.setItem('sessions', JSON.stringify(sessions));

// це треба вішати на кнопку!!!
// Очищаємо всі дані збережені в локальному сховищі. Усі збережені дані будуть втрачені.
// localStorage.clear();





